import math
#подключаем библиотека для использвония математических выражений


def area(r):
    return math.pi * r * r  
#вычисляем площадь круга
#входные значения : r - радиус круга
#выодные значения : площаль круга
	 
				


def perimeter(r):
    return 2 * math.pi * r
#вычисляем радиус круга
#входные значения : r - радиус круга
#выодные значения : радиус круга

int x = 10
print ( area( x ) )
#пример вызова функции для вычисления площади круга радиуса x = 10
print ( perimetr( x ) )
#пример вызова функции для вычисления длины круга радиуса x = 10
