import math


def area(r):
    '''
    Принимает радиус окружности r, возвращает площадь окружности.

    Параметры:
        r (int): радиус окружности
    
    Возвращаемое значение:
         math.pi * r * r: площадь окружности

    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Принимает радиус окружности r, возвращает периметр окружности.

    Параметры:
        r (int): радиус окружности
    
    Возвращаемое значение:
         2 * math.pi * r: площадь окружности

    '''
    return 2 * math.pi * r

