import math


def area(r):
    return math.pi * r * r
'''
Принимает число r (радиус круга), возвращает площадь круга

        Параметры:
            r (int): радиус круга
        
        Возвращаемое значение:
            площадь круга

Пример:
        Параметры:
            r=2
        Возвращаемое значение:
            12.566371
'''

def perimeter(r):
    return 2 * math.pi * r
'''
Принимает число r (радиус круга), возвращает периметр круга

        Параметры:
            r (int): радиус круга
        
        Возвращаемое значение:
            периметр круга

Пример:
        Параметры:
            r=2
        Возвращаемое значение:
            6.2831855
'''
