def area(a, b): 
    '''
    Возвращает площадь прямоугольника.

            Параметры:
                    a (int/float): длина прямоугольника
                    b (int/float): ширина прямоугольника
            
            Возвращаемое значение: площадь прямоугольника (int/float)

            Input: (6, 4)
            Output: (24)
    ''' 
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника.

            Параметры:
                    a (int/float): длина прямоугольника
                    b (int/float): ширина прямоугольника

            Возвращаемое значение: периметр прямоугольника (int/float)

            Input: (6, 4)
            Output: (20)
    ''' 
    return (a + b) * 2 
