def area(a, b):
    '''
    Принимает стороны прямоугольника, возвращает площадь прямоугольника.

    Параметры:
        a (int): сторона прямоугольника
        b (int): сторона прямоугольника
    
    Возвращаемое значение:
         a * b: площадь прямоугольника

    '''
    return a * b 

def perimeter(a, b): 
    '''
    Принимает стороны прямоугольника, возвращает периметр прямоугольника.

    Параметры:
        a (int): сторона прямоугольника
        b (int): сторона прямоугольника
    
    Возвращаемое значение:
         2*(a + b): периметр прямоугольника

    '''
    return 2*(a + b)
