
def area(a, b):
    '''
    Принимает числа a и b - длины сторон прямоугольника.
    Возвращает произведение a * b - площадь прямоугольника.

    Примеры вызова функции :
    Входные данные           Выходные данные
    area(1, 2)             = 2
    area(5.5, 6)           = 33.0
    area(10.1, 11.7)       = 118.16999999999999
    '''
    return a * b
    
    
def perimeter(a, b):
    '''
    Принимает числа a и b - длины сторон прямоугольника.
    Возвращает произведение (a + b) * 2 - периметр прямоугольника.

    Примеры вызова функции :
    Входные данные           Выходные данные
    area(1, 2)             = 6
    area(5.5, 6)           = 23.0
    area(10.1, 11.7)       = 43.599999999999994
    '''
    return (a + b) * 2
