def area(a, b):
    '''Принимает числа a и b - стороны прямоугольника. Возвращает площадь данного прямоугольника.'''
    return a * b
    ''' Примеры вызова функции
    Пример 1
    Ввод: 3, 18
    Вывод: 54

    Пример 2
    Ввод: 4200, 2
    Вывод: 8400
    '''

def perimeter(a, b):
    '''Принимает числа a и b - стороны прямоугольника. Возвращает периметр данного прямоугольника.'''
    return (a + b) * 2
    ''' Примеры вызова функции
    Пример 1
    Ввод: 6, 6
    Вывод: 24

    Пример 2
    Ввод: 200061, 42
    Вывод: 400206
    '''