def area(a, b):
    # Принимает длину и ширину прямоугольника
    # Параметры:
    #         a (int): длина прямоугольника
    #         b (int): ширина прямоугольника
    # Возвращаемое значение:
    #         возвращает площадь прямоугольника
    return a * b

def perimeter(a, b):
    # Принимает длину и ширину прямоугольника
    # Параметры:
    #         a (int): длина прямоугольника
    #         b (int): ширина прямоугольника
    # Возвращаемое значение:
    #         возвращает периметр прямоугольника (int)
    return 2 * (a + b)