
def area(a, b): 
    '''
    
    Функция принимает на вход два десятичных натуральных числа a,b и возвращает десятичное натуральное число, площадь прямоугольника, длина сторон которого соответственно равна данным числам
    Пример:area(10, 20) = 200
    
    '''
    return a * b 

def perimeter(a, b):
    '''
    
    Функция принимает на вход два десятичных натуральных числа a,b и возвращает десятичное натуральное число, периметр прямоугольника, длина сторон которого соответственно равна данным числам
    Пример: perimeter(10, 20) = 60
    
    '''
    return 2a + 2b 
