def area(a, b):
    ''' функция получает на вход стороны прямоугольника и возвращает его площадь 
    
                переменные a, b является сторонами прямоугольника,
                
                например: функция получет на вход a = 3, b = 2, возвращаемое значение: 6'''
    
    return a * b 

def perimeter(a, b):
    ''' функция получает на вход стороны прямоугольника и возвращает его периметр 
    
                переменные a, b является сторонами прямоугольника,
                
                например: функция получет на вход a = 3, b = 2, возвращаемое значение: 10'''
    
    return 2 * (a + b)
