def area(a, b):
    """
    Возвращает площадь прямоугольника на основе переданных ему сторон.
        param: a (int|float) - одна сторона прямогульника;
        param: b (int|float) - другая сторона прямоуголника;
    return: square (int|float) - площадь прямоугольника.
    """ 
    return a * b 

def perimeter(a, b):
    """
    Возвращает периметр прямоугольника на основе переданных ему сторон.
        param: a (int|float) - одна сторона прямогульника;
        param: b (int|float) - другая сторона прямоуголника;
    return: perimeter (int|float) - периметр прямоугольника.
    """  
    return (a + b) * 2
