def area(a, b):
    '''
    Возвращает площадь прямоугольника в десятичном формате

        Параметры:
        а (int) - первая сторона прямоугольника в десятичном формате
        b (int) - вторая сторона прямоугольника в десятичном формате

        Возвращаемое значение:
        area (int) - Площадь прямоугольника в десятичном формате
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника в десятичном формате

        Параметры:
        а (int) - первая сторона прямоугольника в десятичном формате
        b (int) - вторая сторона прямоугольника в десятичном формате

        Возвращаемое значение:
        perimeter (int) - периметр прямоугольника в десятичном формате
    '''
    return 2 * (a + b)
