def area(a, b):
    ''' Принимает числа a и b (стороны прямоугольника), возвращает площадь прямоугольника. 
    
    Пример вызова:
            Принимаемое значение: 2, 3 (a, b)
            Возвращаемое значение: 6 (a * b)
    '''
    return a * b
    
def perimeter(a, b):
    ''' Принимает числа a и b (стороны прямоугольника), возвращает периметр прямоугольника. 
    
    Пример вызова:
            Принимаемое значение: 2, 3 (a, b)
            Возвращаемое значение: 10 (2 * a + 2 * b)
    '''
    return (a + b) * 2
    
