def area(a, b): 
    '''
    Функция возвращает значение площади прямоугольника 

            Входные данные:

                    a: длина прямоугольника
                    b: ширина прямоугольника

            Возвращаемое значение:

                    a*b: значение площади прямоугольника со сторонами a и b

    Пример:

            input: 5, 2        output: 10
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Функция возвращает значение периметра прямоугольника 

            Входные данные:

                    a: длина прямоугольника
                    b: ширина прямоугольника

            Возвращаемое значение:

                    (a+b)*2: значение периметра прямоугольника со сторонами a и b
    Пример:

            input: 5, 2        output: 14
    '''
    return (a + b)*2
