def area(a, b):
    '''
    подсчитывает площадь прямоугольника по его сторонам.
    на вход принимает две непротиволежащие стороны.
    на выход выдает площадь прямоугольника.
    пример ввода: 1, 4
    вывод: 4
    '''
    return a * b 

def perimeter(a, b):
    '''
    подсчитывает периметр прямоугольника по его сторонам.
    на вход принимает две непротиволежащие стороны.
    на выход выдает периметр прямоугольника.
    пример ввода: 1, 4
    вывод: 10
    '''
    return a + b + a + b
