def area(a, b):
    '''
    Принимает длину a и ширину b и возвращает произведение этих чисел ( Площадь прямоугольника )
        Параметры:
            a (int): Длина прямоугольника
            b (int): Ширина прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Принимает длину a и ширину b и возвращает удвоенную сумму этих чисел ( Периметр прямоугольника )
        Параметры:
            a (int): Длина прямоугольника
            b (int): Ширина прямоугольника
    '''
    return (a + b) * 2