def area(a, b): 
    '''
    Принимает числа a и b (стороны прямоугольника), возвращает произведение чисел a и b (площадь прямоугольника)

    Пример вызова функции:
        Входное значение a, b (int, int): 5, 6
        Возвращаемое значение area (int): 30
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Принимает числа a и b (стороны прямоугольника), возвращает удвоенную сумму чисел a и b (периметр прямоугольника)

    Пример вызова функции:
        Входное значение a, b (int, int): 5, 6
        Возвращаемое значение area (int): 22
    '''
    return 2*(a + b) 
