def area(a, b):
#функция вычисления площади прямоугольник
#входные значения a - длина и b - ширина
#выходные значения площадь прямоугольника
#при входных значениях a = 10 and b = 20. area(10, 20) вернет нам 10 * 20 = 200
    return a * b 
    
def perimeter(a, b): 
#функция вычисления периметра прямоугольник
#входные значения a - длина и b - ширина
#выходные значения периметр прямоугольника
#при вызове функции для значений a = 10 and b = 20. Функция perimeter(10,20) вернет нам (10 + 20) * 2 = 60
    return (a + b) * 2
