def area(a, b):
    '''
    Аргументы функции: число a, число b
    Возвращаемое значение: произведение чисел a и b
    Пример 1: a = 2, b = 3. Функция вернёт число 6 (area(2, 3) = 6)
    Пример 2: a = 2, b = 2.5. Функция вернёт число 5.0 (area(2, 2.5) = 5.0)
    '''
    return a * b 

def perimeter(a, b):
    '''
    Аргументы функции: число a, число b
    Возвращаемое значение: сумма произведения числа 2 и числа a и произведения числа 2 и числа b
    Пример: a = 2, b = 3. Функция вернёт число 10 (perimetr(2, 3) = 10)
    '''
    return 2*a + 2*b
