def area(a, b):
    '''
        Функция вычисления площади прямоугольник
        Входные значения a - длина и b - ширина
        Выходные значения площадь прямоугольника
        При входных значениях a = 10 and b = 20. area(10, 20) вернет нам 10 * 20 = 200
    '''
    return a * b 
    
def perimeter(a, b):
    '''
        Функция вычисления периметра прямоугольник
        Входные значения a - длина и b - ширина
        Выходные значения периметр прямоугольника
        При вызове функции для значений a = 10 and b = 20. Функция perimeter(10,20) вернет нам (10 + 20) * 2 = 60
    '''
    return (a + b) * 2
