def area(a, b):
    '''
    Принимает две стороны прямоугольника, возвращает площадь прямоугольника.
        Параметры:
            a: первая сторона прямоугольника
            b: вторая сторона прямоугольника
        Возращаемое значение:
            Площадь прямоугольника
    area(5, 6) -> 30
    '''
    return a * b

def perimeter(a, b):
    '''
    Принимает две  стороны прямоугольника, возвращает периметр прямоугольника.
        Параметры:
            a: первая сторона прямоугольника
            b: вторая сторона прямоугольника
        Возращаемое значение:
            Периметр прямоугольника
    perimeter(5, 6) -> 22
    '''
    return (a + b) * 2
