def area(a, b):
    """
    Принимает длины сторон прямоугольника a и b и возвращает его площадь.

    Пример:
        Ввод:
        a = 3
        b = 4

        Вывод:
        12
    :param a: Длина стороны a.
    :param b: Длина стороны b.
    :return: Площадь.
    """
    return a * b


def perimeter(a, b):
    """
    Принимает длины сторон прямоугольника a и b и возвращает его периметр.

    Пример:
        Ввод:
        a = 3
        b = 4

        Вывод:
        14
    :param a: Длина стороны a.
    :param b: Длина стороны b.
    :return: Периметр.
    """
    return (a + b) * 2
