def area(a, b): 
    return a * b


'''
Принимает значения двух переменных(стороны фигуры(прямоугольника)) и выводит площадь(прямоугольника)
        Параметры: a(int/float) - первое десятичное число
                   b(int/float) - второе десятичное число
        Возвращаемое значение: area(int/float): десятичное число(площадь фигуры(прямоугольника))   
'''


def perimeter(a, b): 
    return (a + b) * 2


'''
Принимает значения двух переменных(стороны фигуры(прямоугольника)) и выводит периметр(прямоугольника)
        Параметры: a(int/float) - первое десятичное число
                   b(int/float) - второе десятичное число
        Возвращаемое значение: perimeter(int/float): десятичное число(периметр фигуры(прямоугольника))   
'''
