def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (int): длина одной стороны прямоугольника
            b (int): длина другой стороны прямоугольника

        Возвращаемое значение:
            area (int): площадь прямоугольика
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.

        Параметры:
            a (int): длина одной стороны прямоугольника
            b (int): длина другой стороны прямоугольника

        Возвращаемое значение:
            perimeter (int): периметр прямоугольика
    '''
    return 2 * (a + b)