def area(a, b): 
    return a * b 
'''
Принимает число a (первая сторона прямоугольника)
и b (вторая сторона прямоугольника), возвращает площадь прямоугольника

        Параметры:
            a (int): первая сторона прямоугольника
            b (int): вторая сторона прямоугольника
        
        Возвращаемое значение:
            площадь прямоугольника
    
Пример:
        Параметры:
            a=2
            b=8
        Возвращаемое значение:
            16
'''

def perimeter(a, b): 
    return (a + b)*2
'''
Принимает число a (первая сторона прямоугольника)
и b (вторая сторона прямоугольника), возвращает периметр прямоугольника

        Параметры:
            a (int): первая сторона прямоугольника
            b (int): вторая сторона прямоугольника
        
        Возвращаемое значение:
            периметр прямоугольника

Пример:
        Параметры:
            a=4
            b=5
        Возвращаемое значение:
            18
'''
