def area(a, b): 
    return a * b 
#функция вычисления площади прямоугольник
#входные значения a - длина и b - ширина
#выходные значения площадь прямоугольника
def perimeter(a, b): 
    return (a + b) * 2
#функция вычисления периметра прямоугольник
#входные значения a - длина и b - ширина
#выходные значения периметр прямоугольника

int x = 10
int y = 20
print ( area( x, y ) )
#вызов функции вычисления площади прямоугольника с длиной x = 10 и шириной y = 20
print ( perimetr( x, y ) )
#вызов функции вычисления периметра прямоугольника с длиной x = 10 и шириной y = 20
