def area(a, b):
    '''
    Возвращает площадь прямоугольника с заданными сторонами.

            Параметры:
                    a (float): первая сторона прямоугольника
                    b (float): вторая сторона прямоугольника

            Возвращаемое значение:
                    rectangle_area (float): площадь прямоугольника со сторонами a и b
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника с заданными сторонами.

            Параметры:
                    a (float): первая сторона прямоугольника
                    b (float): вторая сторона прямоугольника

            Возвращаемое значение:
                    rectangle_perimeter (float): периметр прямоугольника со сторонами a и b
    '''
    return 2*(a + b)
