def area(a, b): 
    '''
    Функция нахождения площади прямоугольника по формуле a*b
        Параметры:
                a (float) длина первой стороны вещественное положительное число
                b (float) длина второй стороны вещественное положительное число
        Возвращаемое значение
                area (float) площадь прямоугольника вещественное положительное число
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Функция находит периметр прямоугольника по формуле 2(a + b)
        Параметры:
            a (float) длина первой стороны вещественное положительное число
            b (float) длина второй стороны вещественное положительное число
        Возвращаемое значение
            perimeter (float) периметр прямоугольника вещественное положительное число
    '''
    return 2 * (a + b)