def area(a, b):
    '''
        Возращает площадь прямоугольника.

        Параметры:
            a (int) - длина прямоугольника.
            b (int) - ширина прямоугольника.

        Возращаемое значение:
            s (int) - площадь прямоугольника.
    '''
    s = a * b
    return s

def perimeter(a, b):
    '''
        Возращает периметр прямоугольника.

        Параметры:
            a (int) - длина прямоугольника.
            b (int) - ширина прямоугольника.

        Возращаемое значение:
            p (int) - периметр прямоугольника.
    '''
    p = 2 * a + 2 * b
    return p