def area(a, b): 
    '''
    Возвращает площадь заданного прямоугольника
	
	Параметры:
	    a (int): длина прямоугольника
	    b (int): ширина прямоугольника

	Возвращаемое значение:
	    area (int): площадь искомого прямоугольника

    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр заданного прямоугольника
	
	Параметры:
	    a (int): длина прямоугольника
	    b (int): ширина прямоугольника

	Возвращаемое значение:
	    perimeter (int): периметр искомого прямоугольника

    '''
    return 2 * (a + b)
