def area(a, b):
    '''Возвращает площадь прямоугольника со сторонами a и b
        Параметры:
            a, b: стороны прямоугольника
        Возвращаемое значение:
            a * b: площадь прямоугольника
        Пример вызова area(3, 2):
            Входные данные: 3 2
            Вывод: 6'''
    return a * b

def perimeter(a, b):
    '''Возвращает периметр прямоугольника со сторонами a и b
        Параметры:
            a, b: стороны прямоугольника
        Возвращаемое значение:
            (a + b) * 2: периметр прямоугольника
        Пример вызова perimetr(3, 2)`:
            Входные данные: 3 2
            Вывод: 10'''
    return (a + b) * 2