def area(a):
    '''
	 Принимает число a(сторону квадрата).
	 Возвращает площадь квадрата (сторона квадрата в квадрате a*a)
	 Параметры:
		 a(int/float)
	 Возвращаемое значение:
		 a*a(int/float)
    '''
    return a * a
'''
Пример вышеприведенной функции:
a = 2 (int)
area(a) = 4 (int)
'''

def perimeter(a):
    '''
	 Принимает число a(сторону квадрата).
	 Возвращает периметр квадрата (сторона квадрата, умноженная на 4)
	 Параметры:
		 a(int/float)
	 Возвращаемое значение:
		 4*a(int/float)
    '''
    return 4 * a
'''
Пример вышеприведенной функции:
a = 2 (int)
perimeter(a) = 8 (int)
'''