
def area(a: float) -> float:
    """
    Возвращает площадь квадрата со стороной a

    Параметры:
        a (float): сторона квадрата

    Возвращаемое значение:
        square_area (float): Площадь квадрата с заданной стороной
    """
    return a * a


def perimeter(a: float) -> float:
    """
    Возвращает периметр квадрата со стороной a

    Параметры:
        a (float): сторона квадрата

    Возвращаемое значение:
        square_perimeter (float): Периметр квадрата с заданной стороной
    """
    return 4 * a
