
def ''' функция получает на вход сторону квадрата и возвращает его площадь 
    
                переменная a является стороной квадрата,
                
                например: функция получет на вход a = 3,  возвращаемое значение: 9'''
    
    return a * a


def perimeter(a):
    ''' функция получает на вход сторону квадрата и возвращает его периметр 
    
                переменная a является стороной квадрата,
                
                например: функция получет на вход a = 3,  возвращаемое значение: 12'''
    
    return 4 * a
