def area(a):
    '''
    Возвращает площадь заданого квадрата
	
	Параметры:
	    a (int): длина стороны квадрата

	Возвращаемое значение:
	    area (int): площадь искомого квадрата

    Пример вызова:
        square_area = area(5)
    Результат:
        square_area = 25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр заданого квадрата
	
	Параметры:
	    a (int): длина стороны квадрата

	Возвращаемое значение:
	    периметр (int): перимитр искомого квадрата

    Пример вызова:
        square_perimeter = perimeter(5)
    Результат:
        square_perimeter = 20
    '''
    return 4 * a
