
def area(a):
    '''
    Принимает число a - длины сторон квадрата.
    Возвращает a^2 - площадь квадрата.

    Примеры вызова функции :
    Входные данные           Выходные данные
    area(2)                = 4
    area(5.5)              = 30.25
    area(10)               = 100
    '''
    return a * a


def perimeter(a):
    '''
    Принимает число a - длины сторон квадрата.
    Возвращает 4 * a - периметр квадрата.

    Примеры вызова функции :
    Входные данные           Выходные данные
    area(2)                = 8
    area(5.5)              = 22.0
    area(10)               = 40
    '''
    return 4 * a
