def area(a):
    '''
    Принимает значение 1 переменной (сторона фигуры(квадрата)) и выводит площадь фигуры(квадрата)
            Параметры: a(int/float) - десятичное число
            Возвращаемое значение: area(int/float): десятичное число(площадь фигуры(квадрата))
            Пример вызова: print(area(7)) -> 49
    '''
    return a * a


def perimeter(a):
    '''
    Принимает значение 1 переменной (сторона фигуры(квадрата)) и выводит периметр фигуры(квадрата)
            Параметры: a(int/float) - десятичное число
            Возвращаемое значение: perimeter(int/float): десятичное число(периметр фигуры(квадрата))
            Пример вызова: print(perimeter(6)) -> 24
    '''

    return 4 * a
