def area(a):
    return a * a


'''
Принимает значение 1 переменной (сторона фигуры(квадрата)) и выводит площадь фигуры(квадрата)
        Параметры: a(int/float) - десятичное число
        Возвращаемое значение: area(int/float): десятичное число(площадь фигуры(квадрата))
'''


def perimeter(a):
    return 4 * a


'''
Принимает значение 1 переменной (сторона фигуры(квадрата)) и выводит периметр фигуры(квадрата)
        Параметры: a(int/float) - десятичное число
        Возвращаемое значение: perimeter(int/float): десятичное число(периметр фигуры(квадрата))
'''
