
def area(a):
    '''
        Функция принимает сторону квадрата и выводит его площадь

        Параметры:
            a (float): сторона квадрата

        Возвращаемое значение:
            area(a) (float): площадь квадрата со стороной a

        Пример использования:
            Входные данные
                3.0
            Выходные данные
                9.0
    '''
    return a * a


def perimeter(a):
    '''
        Функция принимает сторону квадрата и выводит его периметр

        Параметры:
            a (float): сторона квадрата

        Возвращаемое значение:
            perimeter(a) (float): периметр квадрата со стороной a

        Пример использования:
            Входные данные
                3.0
            Выходные данные
                12.0
    '''
    return 4 * a
