def area(a):
    '''
    Возвращает площадь квадрата со стороной a

        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            square_area (int): площадь квадрата со стороной a

    Пример вызова:
        area(5) = 25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a

        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            square_perimeter (int): периметр квадрата со стороной a

    Пример вызова:
        perimeter(8) = 32
    '''
    return 4 * a
