
def area(a):
    '''
    Возвращает площадь квадрата

            Параметры:
                    a (int): сторона квадрата

            Возвращаемое значение:
                    a*a (int): квадрат a

    Пример:

            Входные данные:
                    a = 24

            Выходные данные:
                    96
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата

             Параметры:
                    a (int): сторона квадрата

            Возвращаемое значение:
                    4*a (int): произведение 4 и a

    Пример:

            Входные данные:
                    a = 24

            Выходные данные:
                    96
    '''
    return 4 * a
