def area_square(a):
    '''
    Возвращает площадь квадрата с заданной длиной стороны.

    Параметры:
        a (float): длина стороны квадрата

    Возвращаемое значение:
        area (float): площадь квадрата
    Пример использования:
        >>> area(5)
    25
    '''
    return a * a

def perimeter_square(a):
    '''
    Возвращает периметр квадрата с заданной длиной стороны.

    Параметры:
        a (float): длина стороны квадрата

    Возвращаемое значение:
        perimeter (float): периметр квадрата
    Пример использования:
        >>> perimeter(5)
    20
    '''
    return 4 * a
