def area(a):
    """
    Вычисляет площадь квадрата.

    Входные данные:
    a (float): Сторона квадрата.

    Возвращает:
    float: Площадь квадрата.

    Пример использования:
    >>> area(5)
    25
    """
    return a * a

def perimeter(a):
    """
    Вычисляет периметр квадрата.

    Входные данные:
    a (float): Сторона квадрата.

    Возвращает:
    float: Периметр квадрата.

    Пример использования:
    >>> perimeter(5)
    20
    """
    return 4 * a
