
def area(a):
    """Принимает сторону a и возвращает площадь квадрата с такой стороной
    Параметр: a (int) - сторона квадарата
    Возвращает: area (int) - площадь квадрата с указанной стороной

    print(area(3))
    ---------------------
    9"""
    return a * a


def perimeter(a):
    """Принимает сторону a и возвращает периметр квадарата с таким радиусом
    Параметр: a (int) - сторона квадарата
    Возвращает: perimeter (int) - периметер квадрата с указанной стороной

    print(perimeter(3))
    ---------------------
    12"""
    return 4 * a
