
def area(a):
    '''
    Возвращает площадь квадрата со стороной a.

        Параметры:
            a: длина стороны квадрата
        
        Возвращаемое значение:
            area: площадь квадрата со стороной a
        
        Примеры вызова:
            area(4) = 16
            area(2.5) = 6.25
            area(0) = 0
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a.

        Параметры:
            a: длина стороны квадрата
        
        Возвращаемое значение:
            perimeter: периметр квадрата со стороной a  
        
        Примеры вызова:
            perimeter(4) = 16
            perimeter(2.5) = 10.0
            perimeter(0) = 0
    '''
    return 4 * a
