def area(a):
    """ Возвращает площадь квадрата
            Параметры:
                a (int): сторона квадрата
            Возвращаемое значение:
                area (int): площадь квадрата
    Пример вызова:
        area(2) -> 4
    """
    return a * a


def perimeter(a):
    """ Возвращает периметр квадрата
            Параметры:
                a (int): сторона квадрата
            Возвращаемое значение:
                perimeter (int): Периметр квадрата
    Пример вызова:
        perimeter(2) -> 8
    """
    return 4 * a
