def area(a):
    ''' 
    Возвращает площадь квадрата
        
        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            area (int): площадь квадрата со стороной a
        
        Пример:
            area(5) вернет 25
    ''' 
    return a * a


def perimeter(a):
    '''
    Возвращает периметер квадрата
        
        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            perimeter (int): периметер квадрата со стороной a
        
        Пример:
            perimeter(5) вернет 20
    '''
    return 4 * a
