
def area(a):
    '''
    Возвращает площадь квадрата по заданной стороне
        Параметры:
            a (int): сторона a - десятичное число
        Возвращаемое значение:
            area (int): десятичное число - площадь квадрата
        Примеры использования: area(5) Возвращает: Вывод: 25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по заданной стороне
        Параметры:
            a (int): сторона a - десятичное число
        Возвращаемое значение:
        Примеры использования: perimeter(4) Возвращает: 16
    '''
    return 4 * a
