
class Square:
    def area(a):
        '''
        Вычисляет площадь квадрата со стороной длины "a"

            Входные данные:
                double a : длина стороны квадрата
            
            Выходные данные:
                double area : площадь квадрата со стороной длины "a"
            Пример работы:
                >> area(5)
                >> 25
        '''
        return a * a


    def perimeter(a):
        '''
        Вычисляет периметр квадрата со стороной длины "a"

            Входные данные:
                double a : длина стороны квадрата

            Выходные данные:
                double perimeter : периметр квадрата со стороной длины "a"
            Пример работы:
                >> perimeter(5)
                >> 20
        '''
        return 4 * a
