def area(a):
    '''
    Возвращает площадь квадрата с заданной стороной.

            Параметры:
                    a (float): сторона квадрата

            Возвращаемое значение:
                    square_area (float): площадь квадрата со стороной a

    Примеры вызова функции:
        area(1.0) = 1.0
        area(2.39) = 5.7121
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата с заданной стороной.

            Параметры:
                    a (float): сторона квадрата

            Возвращаемое значение:
                    square_perimeter (float): периметр квадрата со стороной a

    Примеры вызова функции:
        perimeter(1.0) = 4.0
        perimeter(2.39) = 9.56
    '''
    return 4 * a
