def area(a):
    '''
    Возвращает площадь квадрата.

        Параметры:
            a (int): длина стороны квадрата

        Возвращаемое значение:
            area (int): площадь квадрата

        Пример вызова:
            area(3) = 9
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата.

        Параметры:
            a (int): длина стороны квадрата

        Возвращаемое значение:
            perimeter (int): периметр квадрата

        Пример вызова:
            perimeter(3) = 12
    '''
    return 4 * a
