
def area(a):
    """
    Вычисляет площадь квадрата.

    Параметры:
        a (float): длина стороны квадрата.

    Возвращаемое значение:
        (float): площадь квадрата.

    Пример использования:
        >>> square.area(4)
        16
    """
    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата.

    Параметры:
        a (float): длина стороны квадрата.

    Возвращаемое значение:
        (float): периметр квадрата.

    Пример использования:
        >>> square.perimeter(8)
        32
    """
    return 4 * a
