
def area(a):
    """
    print(square.area(10)) # 100

    Возвращает площадь квадрата с указанной стороной

        Параметры:
            a (int) - длина стороны

        Возвращаемое значение:
            square_area (int) - площадь квадрата со стороной равной a
    """
    return a * a


def perimeter(a):
    """                                                 
    print(square.perimeter(10)) # 40

    Возвращает периметр квадрата с указанной стороной

        Параметры:
            a (int) - длина стороны

        Возвращаемое значение:
            rectangle_perimeter (int) - периметр квадрата со стороной равной a
    """
    return 4 * a
