def area(a):
    '''
    Возвращает площадь квадрата с заданной стороной.

            Параметры:
                    a (float): сторона квадрата

            Возвращаемое значение:
                    square_area (float): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата с заданной стороной.

            Параметры:
                    a (float): сторона квадрата

            Возвращаемое значение:
                    square_perimeter (float): периметр квадрата со стороной a
    '''
    return 4 * a
