import unittest


def area(a):
    '''
    Возвращает площадь крадрата.
        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            area (int): площадь крадрата со стороной a
    Пример вызова:
        area(2) возвращает 4
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр крадрата.
        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            perimeter (int): периметр крадрата со стороной a
    Пример вызова:
        area(2) возвращает 8
    '''
    return 4 * a



