
def area(a):
    '''
    Возвращает площадь квадрата.

    Параметры:
    a (float): сторона квадрата

    Возвращаемое значение: float, площадь квадрата, равная a^2.

    Пример вызова функции:
    area(4.0)
    Результат: 16.0
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата.

    Параметры:
    a (float): сторона квадрата

    Возвращаемое значение: float, периметр квадрата, равный 4*a.

    Пример вызова функции:
    perimeter(4.0)
    Результат: 16.0
    '''
    return 4 * a
