
def area(a):
    '''
    Принимает число a, возвращает площадь квадрата.
        Параметры:
            a (int): сторона квадрата
        Возращаемое значение:
            Площадь квадрата
        Пример:
            area(3) -> (3 * 3) = 9 
    ''' 
    return a * a


def perimeter(a):
    '''
    Принимает число a, возвращает периметр квадрата.
        Параметры:
            a (int): сторона квадрата
        Возращаемое значение:
            Площадь квадрата
        Пример:
            area(4) -> (4 * 3) = 12 
    ''' 
    return 4 * a
