def area(a
    '''
    Вычисляет и возвращает площадь квадрата.
            Параметры:
                    a (float): длина стороны квадрата, вещественное число
            Возвращаемое значение:
                    area_square (float): площадь квадрата, вычесленная по формуле area_square = a * a 

            Пример вызова:
                Входные данные: 6.0
                Результат: 36.0
    '''
    area_square = a * a 
    return a * a


def perimeter(a):
    '''
    Вычисляет и возвращает периметр квадрата.
            Параметры:
                    a (float): длина стороны квадрата, вещественное число
            Возвращаемое значение:
                    perimetr_square (float): периметр квадрата, вычесленный по формуле perimetr_square = 4 * a

            Пример вызова:
                Входные данные: 3.0
                Результат: 12.0
    '''
    rerimetr_square = 4 * a
    return perimetr_square
