
def area(a):
    return a * a
'''
Принимает число a (сторона квадрата), возвращает площадь квадрата
   
        Параметры:
            a (int): сторона квадрата
        
        Возвращаемое значение:
            площадь квадрата

Пример:
        Параметры:
            a=2
        Возвращаемое значение:
            4
'''

def perimeter(a):
    return 4 * a
'''

Принимает число a (сторона квадрата), вовзращает периметр квадрата

        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            периметр квадрата

Пример:
        Параметры:
            a=2
        Возвращаемое значение:
            8
'''