
def area(a):
    '''
    Возвращает площадь квадрата с данной стороной.

        Параметры:
            a (произвольный числовой тип): длина стороны квадрата

        Возвращаемое значение:
            (произвольный числовой тип): площадь квадрата со стороной a

        Пример вызова:
            Ввод: 5.5
            Вывод: 30.25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата с данной стороной.

        Параметры:
            a (произвольный числовой тип): длина стороны квадрата

        Возвращаемое значение:
            (произвольный числовой тип): периметр квадрата со стороной a

        Пример вызова:
            Ввод: 6
            Вывод: 24
    '''
    return 4 * a
