
def area(a):
    '''
    Возвращает площадь квадрата
        Входные данные:
        a (int) - длина ребра квадрата
        
        Выходные данные:
        area (int) - площадь квадрата
        
        Пример:
            area(5) - вернёт 25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата
        Входные данные:
        a (int) - длина ребра квадрата
        
        Выходные данные:
        perimeter (int) - периметр квадрата
        
        Пример:
            area(5) - вернёт 20
    '''
    return 4 * a
