
def area(a):
    '''
       Принимает значение a - длину стороны квадрата.
       Возвращает значение площади квадрата по формуле: площадь квадрата равна квадрату его стороны
       Примеры вызова:
       Входные данные:    Выходные данные:
       area(2)            = 4
       area(3)            = 9
       area(5)            = 25
    '''
    return a * a


def perimeter(a):
    '''
       Принимает значение a - длину стороны квадрата
       Возвразщает значение периметра квадрата по формуле: периметр квадрата равен произведению его стороны на 4
       Примеры вызова:      
       Входные данные:    Выходные данные:
       perimeter(2)       = 8
       perimeter(3)       = 12
       perimeter(5)       = 20
    '''
    return 4 * a
