def area(a):
    '''
    Возвращает площадь квадрата в десятичном формате

        Параметры:
        а (int) - сторона квадрата в десятичном формате

        Возвращаемое значение:
        area (int) - Площадь квадрата в десятичном формате
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата в десятичном формате

        Параметры:
        а (int) - сторона квадрата в десятичном формате

        Возвращаемое значение:
        perimeter (int) - периметр квадрата в десятичном формате
    '''
    return 4 * a
