
def area(a):
    '''
    Функция area(a) принимает аргумент a (число) и возвращает площадь квадрата со стороной a
    Параметры:
        a (int): сторона квадрата
    Возвращает:
        area(int): площадь квадрата со стороной a
    Примеры:
        a = 2
        s = area(a)
        print(s)
    Output:
        4
    '''
    return a * a


def perimeter(a):
    '''
    Функция perimeter(a) принимает аргумент a (число) и возвращает периметр квадрата со стороной a
    Параметры:
        a (int): сторона квадрата
    Возвращает:
        perimeter(int): периметр квадрата со стороной a
    Примеры:
        a = 2
        s = perimeter(a)
        print(s)
    Output:
        8
    '''
    return 4 * a
