
def area(a):
    '''Возвращает площадь квадрата со стороной a
        Параметры:
            a: сторона квадрата
        Возвращаемое значение:
            a * a: площадь квадрата
        Пример вызова area(3):
            Входные данные: 3
            Вывод: 9'''
    return a * a


def perimeter(a):
    '''Возвращает периметр квадрата со стороной a
        Параметры:
            a: сторона квадрата
        Возвращаемое значение:
            a * 4: периметр квадрата
        Пример вызова perimetr(3):
            Входные данные: 3
            Вывод: 12'''
    return 4 * a
