
def area(a):
    '''Принимает длину a стороны квадрата, возвращает площадь квадрата
    Параметры: 
        a (float): длина стороны
    Возвращаемое значение:
        s (float): площадь квадрата
    Примеры вызова:
        area(2) -> 4
    '''
    return a * a


def perimeter(a):
    '''Принимает длину a стороны квадрата, возвращает периметр квадрата
    Параметры: 
        a (float): длина стороны
    Возвращаемое значение:
        p (float): периметр квадрата
    Примеры вызова:
        area(5) -> 20
    '''
    return 4 * a
