def area(a):
    ''' 
    Принимает длину стороны квадрата
    Параметры:
        a (int): длина стороны квадрата
    Возвращаемое значение:
        возвращает площадь квадрата
    Например:
        def area(4):
        return 4 * 4 Ответ: 16
    '''
    return a * a

def perimeter(a):
    ''' 
    Принимает длину стороны квадрата
    Параметры:
        a (int): длина стороны квадрата
    Возвращаемое значение:
        возвращает периметр квадрата
    Например:
        def perimeter(4):
        return 4 * 4 Ответ: 16
    '''
    return 4 * a
