
def area(a):
    '''
    Получает на вход длину стороны квадрата и возвращает его площадь

        Параметры:

            a (int): длина стороны квадрата
        
        Возвращаемое значение:
        
            square_area (int): площадь квадрата
        
        Пример работы:

            area(5)  =>  25
            area(20)  =>  400

    '''
    return a * a


def perimeter(a):
    '''
    Получает на вход длину стороны квадрата и выводит его периметр

        Параметры:

            a (int): длина стороны квадрата
        
        Возвращаемое значение:
        
            perimetr_area (int): периметр квадрата
        
        Пример работы:

            area(5)  =>  20
            area(20)  =>  80
            
    '''
    return 4 * a
