def area(a, h): 
    ''' Принимает высоту и основание треугольника, возвращает его площадь. 
     
        Пример вызова:
            Принимаемое значение: 2, 3 (a, h)
            Возвращаемое значение: 3 (a * h / 2)
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    ''' Принимает 3 стороны треугольника, возвращает его периметр. 
    
        Пример вызова:
            Принимаемое значение: 2, 3, 4 (a, b, c)
            Возвращаемое значение: 9 (a + b + c)
    '''
    return a + b + c 

