def area(a, h):
    '''Получает длину стороны основания a и длинну высоты опущенную на неё h, возвращает площадь треугольника со стороной a и высотой h'''
    return a * h / 2 

'''print(area(3, 2.4)) найдёт площадь треугольника со сторонами 3, 4, 5 (Выведет: 6)'''

def perimeter(a, b, c):
    '''Получает длину сторон a, b и с, возвращает периметр треугольника со сторонами a, b и с'''
    return a + b + c

'''print(perimeter(3, 4, 5)) найдёт периметр треугольника со сторонами 3, 4, 5 (Выведет: 12)'''

