def area(a, h):
    '''Принимает числа a и h - сторона и проведенная к ней высота треугольника. Возвращает площадь данного треугольника.'''
    return a * h / 2 
    ''' Примеры вызова функции
    Пример 1
    Ввод: 3, 18
    Вывод: 27.0

    Пример 2
    Ввод: 4200, 2
    Вывод: 4200.0
    '''

def perimeter(a, b, c): 
    '''Принимает числа a и h - сторона и проведенная к ней высота треугольника. Возвращает периметр данного треугольника.'''
    return a + b + c
    ''' Примеры вызова функции
    Пример 1
    Ввод: 6, 6, 6
    Вывод: 18

    Пример 2
    Ввод: 200061, 42, 690
    Вывод: 200793
    '''
