def area(a, h):
    return a * h / 2


'''
Принимает значение 2 переменных (сторона фигуры(треугольника) и высота фигуры(треугольника)) и выводит площадь фигуры(треугольника)
        Параметры: a(int/float) - десятичное число
                   b(int/float) - десятичное число
        Возвращаемое значение: area(int/float): десятичное число(площадь фигуры(треугольника))
'''


def perimeter(a, b, c):
    return (a + b + c) * 2


'''
Принимает значение 2 переменных (сторона фигуры(треугольника) и высота фигуры(треугольника)) и выводит периметр фигуры(треугольника)
        Параметры: a(int/float) - десятичное число
                   b(int/float) - десятичное число
        Возвращаемое значение: perimeter(int/float): десятичное число(периметр фигуры(треугольника))
'''
