def area(a, h):
    '''
    Возвращает площадь треугольника в десятичном формате

        Параметры:
        а (int) - сторона треугольника в десятичном формате
        h (int) - высота треугольника в десятичном формате

        Возвращаемое значение:
        area (int) - Площадь треугольника в десятичном формате
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника в десятичном формате

        Параметры:
        а (int) - 1 сторона треугольника в десятичном формате
        b (int) - 2 сторона треугольника в десятичном формате
        c (int) - 3 сторона треугольника в десятичном формате

        Возвращаемое значение:
        perimeter (int) - периметр треугольника в десятичном формате
    '''
    return a + b + c

