def area(a, h):
    # Принимает длину основания и высоту треугольника
    # Параметры:
    #         a (int): длина основания треугольника
    #         h (int): высота треугольника
    # Возвращаемое значение:
    #         возвращает площадь треугольника
    return a * h / 2

def perimeter(a, b, c):
    # Принимает длины сторон треугольника
    # Параметры:
    #         a (int): длина первой стороны треугольника
    #         b (int): длина второй стороны треугольника
    #         c (int): длина третьей стороны треугольника
    # Возвращаемое значение:
    #         возвращает периметр треугольника
    return a + b + c
