def area(a, h):
    """
    Возвращает значение площади треугольника
    :param a: сторона треугольника
    :param h: высота треугольника

    Пример запуска:
        area(3, 4) --> 6
    """
    return a * h / 2

def perimeter(a, b, c):
    """
    Возвращает значение периметра треугольника

    :param a: первая сторона треульгольника
    :param b: вторая сторона треугольника
    :param c: третья сторона треугольника

    Пример запуска:
        perimeter(3, 4, 5) --> 12

    """
    return a + b + c
