def area(a, h):
    ''' функция получает на вход сторону основания треугольника и высоту и возвращает его площадь 
    
                переменная a является стороной треугольника, h - высотой,
                
                например: функция получет на вход a = 3, h = 4,  возвращаемое значение: 6'''
    
    return a * h / 2 

def perimeter(a, b, c):
    ''' функция получает на вход сторону основания треугольника и высоту и возвращает его площадь 
    
                переменная a является стороной треугольника, h - высотой,
                
                например: функция получет на вход a = 3, b = 4, c = 5  возвращаемое значение: 12'''
    
    return a + b + c
