
def area(a, h):
    """
    Возвращает площадь треугольника

    	Параметры:
    		a (int): сторона треугольника, к которой проведена высота
    		h (int): высота треугольника

    	Возвращаемое значение:
    		(float): площадь треугольника
    """
    return a * h / 2

def perimeter(a, b, c):
    """
    Возвращает периметр треугольника

    	Параметры:
    		a (int): первая сторона треугольника
    		b (int): вторая сторона треугольника
    		c (int): третья сторона треугольника

    	Возвращаемое значение:
    		(int): периметр треугольника
    """
    return a + b + c