
def area(a):
    '''
    Возвращает площадь квадрата в десятичном формате

        Параметры:
        а (int) - сторона квадрата в десятичном формате

        Возвращаемое значение:
        area (int) - Площадь квадрата в десятичном формате

        Примеры вызова:
        print(area(2))   \\ 4
        print(area(4))   \\ 16
        print(area(5))   \\ 25  
    '''
    return a * a        # TODO исправить ошибки


def perimeter(a:int):
    '''
    Возвращает периметр квадрата в десятичном формате

        Параметры:
        а (int) - сторона квадрата в десятичном формате

        Возвращаемое значение:
        perimeter (int) - периметр квадрата в десятичном формате

        Примеры вызова:
        print(perimeter(2))   \\ 8
        print(perimeter(4))   \\ 16
        print(perimeter(5))   \\ 20
    '''
    return 4 * a        # TODO исправить ошибки